import BondCalc
'''
假設市場上一、二、三年期無風險即期利率分別為 3.7%、4.2%、4.8%， 計
算一個三年期平價公債的殖利率。
'''
rs = [0.037, 0.042, 0.048]
y = BondCalc.current_y(rs)


'''
假設市場中一、二、三年期平價公債(面額為$100，每年付息一次)的殖利率
分別為 1.5%，1.75%、1.875%，請分別計算出一、二、三年期零息公債的殖
利率。
'''
rs = [0.015]
r_n = BondCalc.interest_rate(rs, rs[-1])
rs = [0.015, 0.0175]
r_n = BondCalc.interest_rate(rs, rs[-1])
rs = [0.015, 0.0175, 0.01875]
r_n = BondCalc.interest_rate(rs, rs[-1])


'''
(a) 假設目前市場中所觀察到的不同期限平價公債的殖利率資料如下表所示:
利用反推法計算出一年半到三年的各期即期利率。
'''
rs = [0.052, 0.0535]
r_n = BondCalc.interest_rate(rs, 0.055, 2)
rs = rs + [r_n]
r_n = BondCalc.interest_rate(rs, 0.058, 2)
rs = rs + [r_n]
r_n = BondCalc.interest_rate(rs, 0.062, 2)
rs = rs + [r_n]
r_n = BondCalc.interest_rate(rs, 0.066, 2)


'''
(b) 一個三年期零息公債的價格（每半年複利）應是多少？
'''
rs = [0.052, 0.0535]
r_n = BondCalc.zero_price(0.0667, 6, 2)

'''
(c) 一個兩年期，票面利率為 4.4%的公債價格為？
'''
rs = [0.052, 0.0535, 0.0551, 0.0582]
p = BondCalc.price(rs, 0.044, 2, 100)



'''
甲先生以 $101,300 購得面額 $100,000 之債券一張，該債券到期期限為七
年，票面利率為 8%，每年付息一次。請問此債券的到期殖利率為何？若此債
券為每半年付息一次，則其到期殖利率又是多少？
'''
r = BondCalc.ytm(0.08, 7, 1, 101300, 100000)

'''
若此債券為每半年付息一次，則其到期殖利率又是多少？
'''
r = BondCalc.ytm(0.08, 7, 2, 101300, 100000)

'''
甲先生以 $101,400 購得面額 $100,000 之債券一張，該債券到期期限尚有四
年，票面利率為3%，每年付息一次。目前市場上一至四年期的即期利率分別
為4%、3%、2.5%、2%。若甲先生的投資期限為三年，請計算此債券的投資
期限報酬率。
'''
# 投資期限報酬率
rs = [0.04, 0.03, 0.025, 0.02]
y = BondCalc.horizon_ytm(rs, 3, 0.03, 100000, 101400)

'''
 假設一檔面額$100,000的債券，到期期限五年，票面利率8%，每年付息一次。
李小姐以$103,800購得此債券，同時預期一年及兩年後的市場利率分別為7%
及6%。若李小姐預期在三年後可將此債券以5%的利率在市場上賣出，請計
算此債券的投資期限報酬率。
'''
# 投資期限報酬率
fs = [0.07, 0.06, 0.05]
y = BondCalc.horizon_ytm(fs, 3, 0.08, 100000, 103800, rs_to_fs=False)


